Repository: brotkrueml/codehighlight
Catalog: Resources/Private/Language/*.ContentElement.xlf
Languages: da, de

# contentElement.title
source: Code Snippet
da: Kode-snippet
de: Code-Ausschnitt

# contentElement.description
source: Insert code snippets and select the programming language for highlighting the code.
da: Indsæt kode-snippets og vælg programmeringssprog for at få fremhævet koden.
de: Fügen Sie Code-Ausschnitte ein und wählen Sie die Programmiersprache für die Hervorhebung des Codes.

source: Code snippet
da: Kode-snippet
de: Code-Ausschnitt

# codeSnippet.notDefined
source: No code snippet defined!
da: Ingen kode-snippet defineret!
de: Kein Code-Ausschnitt definiert!

source: Command line
da: Kommandolinje
de: Kommandozeile

# commandLineOutputFilter
source: Filter output
da: Filter udtræk
de: Ausgabe-Filter

# commandLineOutputFilter.description
source: Alternative for "Output lines": Specify a prefix for lines with output, e.g., "(out)" will treat lines beginning with (out) as output and remove the prefix.
da: Alternativ for "output linjer": Angiv et præfiks for linjer med output, for eksempel "(out)" ve behandle linjer der begynder med (out) som output og fjerne præfikset.
de: Alternative für "Zeilen mit Ausgabe": Geben Sie ein Präfix für Zeilen mit Ausgabe an, z. B. "(out)" wird Zeilen, die mit (out) beginnen, als Ausgabe behandeln und das Präfix entfernen.

# commandLineOutputLines
source: Output lines
da: Output linjer
de: Zeilen mit Ausgabe

# commandLineOutputLines.description
source: You may specify the lines to be presented as output (no prompt and no highlighting) in the following format: A single number refers to the line with that number / Ranges are denoted by two numbers, separated with a hyphen (-) / Multiple line numbers or ranges are separated by commas / Whitespace is allowed anywhere and will be stripped off / Example: 1-2, 5, 9-20 (Lines 1 through 2, line 5, lines 9 through 20)
da: Du kan angive de linjer der skal præsenteres som output (ingen prompt og ingen fremhævning) i følgende format: Et enkelt tal refererer til linjen med dette tal / Rækkevidde er angivet med to tal, separeret med bindestreg (-) / Flere linjenumre eller intervaller adskilles af kommaer / blanke tegn er tilladt hvor som helst og vil blive fjernet / Eksempel: 1- 2, 5, 9-20 (linje 1 til 2, linje 5, linje 9 til og med 20)
de: Sie können die Zeilen, die als Ausgabe dargestellt werden sollen (keine Eingabeaufforderung und keine Hervorhebung), im folgenden Format angeben: Eine einzelne Zahl bezieht sich auf die Zeile mit dieser Zahl / Bereiche werden durch zwei Zahlen gekennzeichnet, die durch einen Bindestrich (-) getrennt sind / Mehrere Zeilennummern oder Bereiche werden durch Kommas getrennt /Leerzeichen ist überall erlaubt und wird entfernt / Beispiel: 1-2, 5, 9-20 (Zeilen 1 bis 2, Zeile 5, Zeilen 9 bis 20)

# commandLineServerHost
source: Host
da: Vært
de: Rechner

# commandLineServerHost.description
source: Specify the host for a server command line (like Linux).
da: Angiv værten for en servers kommandolinje (for eksempel Linux).
de: Geben Sie den Host für eine Server-Kommandozeile (wie Linux) an.

# commandLineServerPrompt.description
source: For any other command line, such as a Windows prompt, specify the entire prompt, e.g. "PS C:\Users\Chris>". If this field is set, user and host are ignored.
da: For enhver anden kommandolinje, såsom en Windows-prompt, angives hele prompten, f.eks "PS C:\Users\Chris>". Hvis dette felt er angivet, ignoreres brugeren og værten.
de: Für jede andere Befehlszeile, wie z. B. die Windows-Eingabeaufforderung, geben Sie die gesamte Eingabeaufforderung an, z. B. "PS C:\Benutzer\Chris>".Wenn dieses Feld gesetzt ist, werden Benutzer und Rechner ignoriert.

# commandLineServerUser
source: User
da: Bruger
de: Benutzer

# commandLineServerUser.description
source: Specify the user for a server command line (like Linux).
da: Angiv værten for en servers kommandolinje (for eksempel Linux).
de: Geben Sie den Benutzer für eine Server-Kommandozeile (wie Linux) an.

source: Display command line
da: Vis kommandolinje
de: Befehlszeile anzeigen

source: Filename
da: Filnavn

# displayCommandLine.description
source: Display a command line with a prompt and, optionally, the output/response from the commands. Important: If you activate this option, don't select a programming language or the prompts are not visible!
da: Vis en kommandolinje med en prompt og eventuelt output/svar fra kommandoerne. Vigtigt: Hvis du aktiverer denne indstilling, skal du ikke vælge et programmeringssprog, for så vil prompterne ikke være synlige!
de: Zeigt eine Befehlszeile mit einer Eingabeaufforderung und optional die Ausgabe/Antwort aus den Befehlen. Wichtig: Wenn diese Option aktiviert wird, keine Programmiersprache auswählen oder die Eingabeaufforderungen sind nicht sichtbar!

source: Highlight lines
da: Fremhæv linjer
de: Zeilen hervorheben

# highlightLines.description
source: You can specify the lines to be highlighted in the following format: A single number refers to the line with that number / Ranges are denoted by two numbers, separated with a hyphen (-) / Multiple line numbers or ranges are separated by commas / Whitespace is allowed anywhere and will be stripped off / Example: 1-2, 5, 9-20 (Lines 1 through 2, line 5, lines 9 through 20)
da: Du kan angive de linjer der skal fremhæves i følgende format: Et enkelt tal refererer til linjen med dette tal / Rækkevidde er angivet med to tal, separeret med bindestreg (-) / Flere linjenumre eller intervaller adskilles af kommaer / blanke tegn er tilladt hvor som helst og vil blive fjernet / Eksempel: 1- 2, 5, 9-20 (linje 1 til 2, linje 5, linje 9 til og med 20)
de: Sie können die Zeilen, die als Ausgabe dargestellt werden sollen, im folgenden Format angeben: Eine einzelne Zahl bezieht sich auf die Zeile mit dieser Zahl / Bereiche werden durch zwei Zahlen gekennzeichnet, die durch einen Bindestrich (-) getrennt sind / Mehrere Zeilennummern oder Bereiche werden durch Kommas getrennt / Leerzeichen ist überall erlaubt und wird entfernt / Beispiel: 1-2, 5, 9-20 (Zeilen 1 bis 2, Zeile 5, Zeilen 9 bis 20)

source: Line numbers
da: Linjenumre
de: Zeilennummern

source: Options
da: Muligheder
de: Optionen

source: Programming language
da: Programmeringssprog
de: Programmiersprache

source: Show line numbers
da: Vis linjenumre
de: Zeilennummern anzeigen

# showLineNumbers.description
source: Activate this option to display line numbers at the beginning of the code lines.
da: Aktivér denne indstilling for at vise linjenumre i begyndelsen af kodelinjerne.
de: Aktivieren Sie diese Option, um Zeilennummern am Anfang der Codezeilen anzuzeigen.

source: Start with line number
da: Start med linjenummer
de: Mit Zeilennummer beginnen

# startWithLineNumber.description
source: Specify a line number with which the numbering is to begin. The number will also be used for "Highlight lines" as offset value.
da: Angiv et linjenummer med hvilket nummereringen skal begynde. Nummeret vil også blive brugt til "Fremhæv linjer" som offset værdi.
de: Geben Sie eine Zeilennummer an, mit der die Nummerierung beginnen soll. Die Nummer wird auch für "Zeilen hervorheben" als Offset-Wert verwendet.

# commandLineServerPrompt
source: Prompt
de: Eingabeaufforderung
