Repository: brotkrueml/codehighlight
Catalog: Resources/Private/Language/*.ProgrammingLanguages.xlf
Languages: de

# abnf
source: Augmented Backus–Naur form
de: Angereicherte Backus-Naur-Form

# apacheconf
source: Apache Configuration
de: Apache-Konfiguration

# armasm
source: ARM Assembly
de: ARM-Assembler

# asm6502
source: 6502 Assembly
de: 6502-Assembler

# asmatmel
source: Atmel AVR Assembly
de: Atmel AVR-Assembler

source: C-like
de: C-ähnlich

source: DNS zone file
de: DNS-Zonen-Datei

# ebnf
source: Extended Backus–Naur form
de: Erweiterte Backus-Naur-Form

source: Excel Formula
de: Excel-Formel

source: Firestore security rules
de: Firestore Sicherheitsregeln

# ftl
source: FreeMarker Template Language
de: FreeMarker Template-Sprache

source: Go module
de: Go-Modul

source: ICU Message Format
de: ICU-Nachrichtenformat

# iecst
source: Structured Text (IEC 61131-3)
de: Strukturierter Text (IEC 61131-3)

# keepalived
source: Keepalived Configure
de: Keepalived-Konfiguration

# linker-script
source: GNU Linker Script
de: GNU Linker-Skript

# log
source: Log file
de: Log-Datei

# q
source: Q (kdb+ database)
de: Q (kdb+-Datenbank)

source: Shell session
de: Shell-Sitzung

source: Solution file
de: Solution-Datei

# systemd
source: Systemd configuration file
de: Systemd-Konfigurationsdatei
